public class KoreanNames
{
	public static string[] FemaleGivenNames = new string[322]
	{
		"서윤", "서연", "지우", "지유", "하윤", "서현", "민서", "하은", "지아", "다은",
		"윤서", "채원", "수아", "지윤", "지민", "소윤", "은서", "소율", "예린", "지안",
		"예원", "수빈", "예은", "시은", "지원", "하린", "주아", "연서", "채은", "유나",
		"윤아", "지율", "하율", "서은", "예나", "서아", "예서", "수연", "채윤", "서영",
		"유진", "서율", "예진", "아리", "연우", "민지", "수민", "다인", "사랑", "소은",
		"시연", "가은", "시아", "수현", "나윤", "유주", "하연", "서하", "예지", "다연",
		"현서", "아윤", "세아", "아린", "다윤", "서진", "주하", "유빈", "서우", "승아",
		"소민", "채아", "다온", "민아", "시현", "윤하", "서희", "나은", "다현", "소연",
		"세은", "예빈", "지은", "세연", "시윤", "지현", "윤지", "은채", "민주", "아영",
		"나연", "가윤", "소현", "민채", "혜원", "도연", "채린", "하영", "유정", "지수",
		"유하", "연아", "윤슬", "아현", "하늘", "은솔", "예슬", "보민", "설아", "채민",
		"하랑", "예림", "정원", "수진", "주은", "나현", "한별", "예주", "지연", "민정",
		"다솜", "태희", "하나", "소희", "다희", "지효", "다빈", "채연", "현아", "하진",
		"아라", "리아", "규리", "태은", "예솔", "민하", "현지", "수지", "가현", "유라",
		"은별", "유림", "효주", "가연", "유리", "은지", "하람", "주연", "태린", "혜린",
		"태연", "승연", "연재", "보미", "유민", "서원", "민경", "지호", "고은", "세빈",
		"은재", "다혜", "다원", "소영", "세영", "도희", "지혜", "나경", "채율", "수정",
		"은수", "서빈", "혜인", "소원", "아연", "가을", "지영", "윤주", "한나", "아름",
		"예인", "채영", "가영", "윤진", "채희", "연주", "지인", "다영", "윤솔", "재희",
		"세린", "소미", "연지", "주희", "유은", "해인", "가빈", "은비", "민솔", "혜윤",
		"서정", "윤채", "다정", "소정", "미소", "해솔", "혜리", "보경", "정연", "나영",
		"희원", "효린", "은빈", "세희", "혜민", "혜빈", "려원", "은혜", "연희", "혜진",
		"효민", "은하", "나희", "지희", "민영", "해나", "가인", "다예", "지예", "주현",
		"해린", "혜주", "하경", "은아", "세현", "다솔", "윤희", "주영", "하라", "혜림",
		"효빈", "희주", "현주", "도경", "유경", "수린", "보영", "수영", "아람", "승주",
		"혜나", "효진", "현정", "효정", "승희", "빛나", "해원", "정인", "예리", "지나",
		"세나", "나라", "정은", "희연", "민희", "희진", "세진", "은영", "은주", "정아",
		"예람", "유미", "나예", "은진", "윤정", "민선", "성은", "선영", "채령", "한비",
		"진희", "해윤", "연진", "미나", "다해", "안나", "다미", "나원", "주혜", "설하",
		"도아", "나래", "미솔", "희수", "효림", "은정", "보현", "세미", "미진", "미현",
		"윤미", "혜정", "라임", "소라", "가희", "은경", "슬기", "보람", "지애", "혜선",
		"송희", "소진", "보라", "선미", "누리", "세리", "세라", "다경", "지온", "혜수",
		"미연", "미희"
	};

	public static string[] MaleGivenNames = new string[322]
	{
		"서준", "하준", "도윤", "시우", "민준", "지호", "예준", "주원", "은우", "서진",
		"유준", "준우", "우진", "시윤", "선우", "수호", "지후", "건우", "윤우", "연우",
		"이준", "도현", "준서", "현우", "지한", "지훈", "민재", "이안", "승우", "정우",
		"시온", "하진", "시현", "지환", "수현", "서우", "현준", "재윤", "하민", "시원",
		"은호", "시안", "진우", "지원", "승현", "한결", "윤호", "도하", "윤재", "승민",
		"태양", "우주", "주호", "민호", "민우", "재원", "재민", "민성", "지성", "민규",
		"시환", "준영", "재현", "준혁", "도겸", "규민", "성빈", "태준", "예성", "은성",
		"승준", "승재", "강민", "태민", "하늘", "승빈", "도훈", "시훈", "성준", "준수",
		"도준", "승윤", "성현", "민혁", "도원", "승호", "지민", "도영", "윤성", "정후",
		"재준", "도진", "준호", "태현", "정민", "성민", "연준", "세준", "유진", "우현",
		"정현", "승원", "동하", "규빈", "민석", "준후", "지혁", "하성", "종현", "유현",
		"세현", "범준", "원준", "호준", "선호", "태인", "다원", "현민", "준성", "현수",
		"주영", "재훈", "재우", "승찬", "우성", "수혁", "영준", "승훈", "찬우", "정훈",
		"경민", "태호", "건후", "현진", "한율", "정빈", "재영", "민기", "동준", "강준",
		"가람", "현승", "현빈", "진호", "태훈", "해준", "성우", "동우", "승철", "정한",
		"준휘", "원우", "명호", "한솔", "승관", "명헌", "명현", "현철", "동호", "동오",
		"태섭", "백호", "태웅", "정환", "준섭", "원호", "은혁", "진혁", "현석", "태성",
		"준기", "세진", "세훈", "한별", "수빈", "준현", "진영", "지석", "동연", "승환",
		"승기", "승혁", "동혁", "정호", "태원", "희성", "재연", "태환", "찬혁", "동규",
		"승하", "지섭", "대한", "성진", "준하", "주헌", "호영", "은결", "형준", "영표",
		"현규", "준모", "태빈", "상준", "민국", "재성", "명준", "상민", "창민", "재범",
		"기현", "우석", "도형", "진욱", "재환", "재용", "서훈", "주빈", "승범", "석준",
		"민상", "영광", "광현", "석진", "한성", "준엽", "태균", "성수", "재승", "기준",
		"찬빈", "현웅", "형석", "범진", "대원", "보성", "준규", "승엽", "재헌", "경태",
		"규진", "은규", "형우", "영웅", "영현", "현중", "한준", "한빈", "원재", "명진",
		"대성", "종훈", "호성", "찬호", "석민", "인호", "승수", "승진", "정욱", "승규",
		"지헌", "지용", "준민", "우영", "종혁", "호진", "민수", "호석", "민승", "주찬",
		"영민", "우혁", "건영", "민욱", "태욱", "영재", "기범", "대호", "현재", "종민",
		"범석", "원빈", "정수", "해찬", "원석", "수한", "정혁", "인우", "도빈", "규현",
		"주혁", "하빈", "진웅", "지웅", "지욱", "인성", "동민", "우섭", "진용", "민섭",
		"성구", "시혁", "세호", "재석", "한진", "경호", "대형", "한수", "종연", "해진",
		"호열", "우식", "진철", "예섭", "유겸", "시후", "정태", "정기", "두영", "해민",
		"중찬", "세혁"
	};

	public static string[] FamilyNames = new string[55]
	{
		"이", "김", "박", "정", "윤", "최", "유", "홍", "신", "권",
		"조", "한", "오", "강", "심", "안", "허", "장", "민", "임",
		"남", "서", "구", "성", "송", "원", "황", "여", "양", "우",
		"나", "손", "노", "도", "부", "추", "배", "맹", "곽", "변",
		"차", "백", "전", "엄", "고", "현", "문", "옥", "하", "소",
		"지", "기", "진", "주", "설"
	};

	public static string MakeName(bool male)
	{
		string[] array = (male ? MaleGivenNames : FemaleGivenNames);
		return FamilyNames[SRand.Range(0, FamilyNames.Length)] + array[SRand.Range(0, array.Length)];
	}
}
