public class RussianNames
{
	public static string[] FemaleGivenNames = new string[129]
	{
		"Александра", "Алина", "Алиса", "Алла", "Алёна", "Анастасия", "Ангелина", "Анжелика", "Анна", "Антонина",
		"Анфиса", "Ариадна", "Арина", "Ася", "Богдана", "Борислава", "Валентина", "Валерия", "Варвара", "Василиса",
		"Вера", "Вероника", "Виктория", "Виолетта", "Галина", "Гелена", "Георгина", "Глафира", "Гульнара", "Дана",
		"Дарина", "Дарья", "Диана", "Дина", "Доминика", "Ева", "Евгения", "Евдокия", "Екатерина", "Елена",
		"Елизавета", "Жанна", "Зарина", "Зинаида", "Злата", "Зоя", "Инга", "Инесса", "Инна", "Ирина",
		"Ия", "Карина", "Кира", "Клавдия", "Ксения", "Лада", "Лариса", "Леся", "Лиана", "Лидия",
		"Лилия", "Лина", "Любовь", "Людмила", "Магда", "Маргарита", "Марианна", "Марина", "Мария", "Марта",
		"Марья", "Матильда", "Мелания", "Милена", "Милица", "Мира", "Моника", "Надежда", "Наталия", "Наталья",
		"Нелли", "Ника", "Нина", "Нонна", "Оксана", "Олеся", "Ольга", "Павлина", "Полина", "Прасковья",
		"Рада", "Раиса", "Регина", "Рената", "Римма", "Роза", "Рузалия", "Сабина", "Светлана", "Серафима",
		"Сильвия", "Снежана", "София", "Софья", "Станислава", "Стефания", "Сусанна", "Таисия", "Тамара", "Татьяна",
		"Тереза", "Ульяна", "Фаина", "Федора", "Фелиция", "Феодора", "Эвелина", "Эвгения", "Эдита", "Элеонора",
		"Эльвира", "Эльмира", "Эмма", "Эммилия", "Эрика", "Юлиана", "Юлия", "Яна", "Ярослава"
	};

	public static string[] MaleGivenNames = new string[155]
	{
		"Август", "Авдей", "Авраам", "Агафон", "Александр", "Алексей", "Альберт", "Анатолий", "Андрей", "Антон",
		"Аркадий", "Арсений", "Артём", "Артемий", "Артур", "Архип", "Богдан", "Болеслав", "Борис", "Бронислав",
		"Вадим", "Валентин", "Валерий", "Варлам", "Василий", "Вениамин", "Викентий", "Виктор", "Виталий", "Владимир",
		"Владислав", "Всеволод", "Вячеслав", "Гавриил", "Гарри", "Геннадий", "Георгий", "Герасим", "Герман", "Глеб",
		"Гордей", "Григорий", "Давид", "Дамир", "Даниил", "Демид", "Денис", "Дмитрий", "Добрыня", "Евгений",
		"Евграф", "Евдоким", "Евсей", "Евстафий", "Егор", "Елисей", "Емельян", "Еремей", "Захар", "Зиновий",
		"Иван", "Игнат", "Игнатий", "Игорь", "Илья", "Иннокентий", "Иосиф", "Ираклий", "Исаак", "Исидор",
		"Искандер", "Казимир", "Кирилл", "Константин", "Корней", "Кузьма", "Лаврентий", "Лев", "Леон", "Леонард",
		"Леонид", "Лука", "Лукьян", "Любомир", "Макар", "Максим", "Марат", "Марк", "Матвей", "Милан",
		"Мирослав", "Михаил", "Мстислав", "Мурат", "Назар", "Нестор", "Никита", "Никодим", "Николай", "Нил",
		"Нифонт", "Олег", "Осип", "Остап", "Оскар", "Павел", "Пётр", "Платон", "Прохор", "Пётр",
		"Радислав", "Рафаил", "Ринат", "Роберт", "Родион", "Роман", "Ростислав", "Руслан", "Рустам", "Савва",
		"Савелий", "Святослав", "Севастьян", "Семён", "Сергей", "Спартак", "Станислав", "Степан", "Стефан", "Тарас",
		"Тимофей", "Тимур", "Тихон", "Трифон", "Ульян", "Устин", "Фёдор", "Феликс", "Филипп", "Флорентий",
		"Фома", "Фёдор", "Харитон", "Христофор", "Эдуард", "Эмиль", "Эрик", "Эрнест", "Юлиан", "Юрий",
		"Яков", "Ян", "Ярослав", "Ярополк", "Ясон"
	};

	public static string[] MaleFamilyNames = new string[242]
	{
		"Абрамов", "Авдеев", "Агафонов", "Аксёнов", "Александров", "Алексеев", "Андреев", "Анисимов", "Антонов", "Артемьев",
		"Астафьев", "Афанасьев", "Баранов", "Белов", "Белозёров", "Беляев", "Беспалов", "Бирюков", "Блинов", "Блохин",
		"Бобров", "Богданов", "Большаков", "Борисов", "Брагин", "Буров", "Быков", "Васильев", "Веселов", "Виноградов",
		"Вишняков", "Власов", "Волков", "Воробьёв", "Воронов", "Воронцов", "Гаврилов", "Галкин", "Герасимов", "Голубев",
		"Горбачёв", "Гордеев", "Горшков", "Григорьев", "Громов", "Гуляев", "Гурьев", "Давыдов", "Данилов", "Дементьев",
		"Денисов", "Дмитриев", "Дорофеев", "Дроздов", "Дубровин", "Дьячков", "Евдокимов", "Евсеев", "Егоров", "Елисеев",
		"Емельянов", "Ермаков", "Ершов", "Ефимов", "Ефремов", "Завьялов", "Зайцев", "Захаров", "Зимин", "Зиновьев",
		"Зубков", "Зуев", "Иванов", "Игнатов", "Игнатьев", "Ильин", "Исаев", "Исаков", "Кабанов", "Казаков",
		"Калашников", "Калинин", "Капустин", "Карпов", "Кириллов", "Киселёв", "Князев", "Ковалёв", "Козлов", "Колесников",
		"Колобов", "Комаров", "Комиссаров", "Кондратьев", "Кононов", "Константинов", "Копылов", "Корнилов", "Королёв", "Костин",
		"Котов", "Кошелев", "Красильников", "Крылов", "Кудрявцев", "Кудряшов", "Кузнецов", "Кузьмин", "Кулагин", "Кулаков",
		"Куликов", "Курочкин", "Лаврентьев", "Лазарев", "Лапин", "Лебедев", "Лихачёв", "Лобанов", "Логинов", "Лукин",
		"Лыткин", "Макаров", "Максимов", "Мамонтов", "Марков", "Мартынов", "Маслов", "Матвеев", "Медведев", "Мельников",
		"Меркушев", "Миронов", "Михайлов", "Моисеев", "Молчанов", "Морозов", "Муравьёв", "Мухин", "Назаров", "Наумов",
		"Некрасов", "Нестеров", "Никитин", "Никифоров", "Николаев", "Новиков", "Носков", "Носов", "Овчинников", "Орехов",
		"Орлов", "Осипов", "Остроумов", "Павлов", "Панов", "Панфилов", "Пахомов", "Пестов", "Петров", "Петухов",
		"Платонов", "Поляков", "Пономарёв", "Попов", "Потапов", "Прохоров", "Пугачёв", "Пушкин", "Раков", "Родионов",
		"Рожков", "Романов", "Рудаков", "Румянцев", "Русаков", "Рыбаков", "Рябов", "Савельев", "Самойлов", "Самсонов",
		"Сафонов", "Селезнёв", "Семёнов", "Сергеев", "Сидоров", "Силин", "Симонов", "Соболев", "Соловьёв", "Сорокин",
		"Степанов", "Субботин", "Суворов", "Суханов", "Сысоев", "Тарасов", "Терентьев", "Тетерин", "Тимофеев", "Титов",
		"Тихонов", "Токарев", "Третьяков", "Трофимов", "Туров", "Уваров", "Ульянов", "Усов", "Устинов", "Ушаков",
		"Фадеев", "Фёдоров", "Филиппов", "Фокин", "Фомичев", "Фомин", "Фролов", "Харитонов", "Хохлов", "Цветков",
		"Чернов", "Чернышев", "Черняев", "Чистяков", "Чугунов", "Шаров", "Шашков", "Шестаков", "Шилов", "Ширяев",
		"Шишкин", "Шубин", "Шульгин", "Щербаков", "Щукин", "Юдин", "Юшков", "Яковлев", "Якушев", "Янков",
		"Ярцев", "Яшин"
	};

	public static string[] FemaleFamilyNames = new string[242]
	{
		"Абрамова", "Авдеева", "Агафонов", "Аксёнова", "Александрова", "Алексеева", "Андреева", "Анисимова", "Антонова", "Артемьева",
		"Астафьева", "Афанасьева", "Баранова", "Белова", "Белозёрова", "Беляева", "Беспалова", "Бирюкова", "Блинова", "Блохина",
		"Боброва", "Богданова", "Большакова", "Борисова", "Брагина", "Бурова", "Быкова", "Васильева", "Веселова", "Виноградова",
		"Вишнякова", "Власова", "Волкова", "Воробьёва", "Воронова", "Воронцова", "Гаврилова", "Галкина", "Герасимова", "Голубева",
		"Горбачёва", "Гордеева", "Горшкова", "Григорьева", "Громова", "Гуляева", "Гурьева", "Давыдова", "Данилова", "Дементьева",
		"Денисова", "Дмитриева", "Дорофеева", "Дроздова", "Дубровина", "Дьячкова", "Евдокимова", "Евсеева", "Егорова", "Елисеева",
		"Емельянова", "Ермакова", "Ершова", "Ефимова", "Ефремова", "Завьялова", "Зайцева", "Захарова", "Зимина", "Зиновьева",
		"Зубкова", "Зуева", "Иванова", "Игнатова", "Игнатьева", "Ильина", "Исаева", "Исакова", "Кабанова", "Казакова",
		"Калашникова", "Калинина", "Капустина", "Карпова", "Кириллова", "Киселёва", "Князева", "Ковалёва", "Козлова", "Колесникова",
		"Колобова", "Комарова", "Комиссарова", "Кондратьева", "Кононова", "Константинова", "Копылова", "Корнилова", "Королёва", "Костина",
		"Котова", "Кошелева", "Красильникова", "Крылова", "Кудрявцева", "Кудряшова", "Кузнецова", "Кузьмина", "Кулагина", "Кулакова",
		"Куликова", "Курочкина", "Лаврентьева", "Лазарева", "Лапина", "Лебедева", "Лихачёва", "Лобанова", "Логинова", "Лукина",
		"Лыткина", "Макарова", "Максимова", "Мамонтова", "Маркова", "Мартынова", "Маслова", "Матвеева", "Медведева", "Мельникова",
		"Меркушева", "Миронова", "Михайлова", "Моисеева", "Молчанова", "Морозова", "Муравьёва", "Мухина", "Назарова", "Наумова",
		"Некрасова", "Нестерова", "Никитина", "Никифорова", "Николаева", "Новикова", "Носкова", "Носова", "Овчинникова", "Орехова",
		"Орлова", "Осипова", "Остроумова", "Павлова", "Панова", "Панфилова", "Пахомова", "Пестова", "Петрова", "Петухова",
		"Платонова", "Полякова", "Пономарёва", "Попова", "Потапова", "Прохорова", "Пугачёва", "Пушкина", "Ракова", "Родионова",
		"Рожкова", "Романова", "Рудакова", "Румянцева", "Русакова", "Рыбакова", "Рябова", "Савельева", "Самойлова", "Самсонова",
		"Сафонова", "Селезнёва", "Семёнова", "Сергеева", "Сидорова", "Силина", "Симонова", "Соболева", "Соловьёва", "Сорокина",
		"Степанова", "Субботина", "Суворова", "Суханова", "Сысоева", "Тарасова", "Терентьева", "Тетерина", "Тимофеева", "Титова",
		"Тихонова", "Токарева", "Третьякова", "Трофимова", "Турова", "Уварова", "Ульянова", "Усова", "Устинова", "Ушакова",
		"Фадеева", "Фёдорова", "Филиппова", "Фокина", "Фомичёва", "Фомина", "Фролова", "Харитонова", "Хохлова", "Цветкова",
		"Чернова", "Чернышёва", "Черняева", "Чистякова", "Чугунова", "Шарова", "Шашкова", "Шестакова", "Шилова", "Ширяева",
		"Шишкина", "Шубина", "Шульгина", "Щербакова", "Щукина", "Юдина", "Юшкова", "Яковлева", "Якушева", "Янкова",
		"Ярцева", "Яшина"
	};

	public static string MakeName(bool male)
	{
		string[] array = (male ? MaleGivenNames : FemaleGivenNames);
		string[] array2 = (male ? MaleFamilyNames : FemaleFamilyNames);
		return array[SRand.Range(0, array.Length)] + " " + array2[SRand.Range(0, array2.Length)];
	}
}
